[{"title":"每日记录","text":"2025&#x2F;10&#x2F;15 周三今天的研究终于取得了一些进展。写模型的老师告诉了我把 AIMPLUM 的 Aglu 版 的设定更改为 global: on 之后对应的 Plum.sh 的修改。至此，困扰了我和前辈一个月的模型 bug 终于被解决了。其实连一个 bug 都算不上，如果老师能在递交模型的时候告诉我们，就不会有后续的麻烦了。困る。 截止写总结，模型已经运行了 3.5 小时了，仍然没有结束。对于俄罗斯和加拿大的每个流域，每计算 10 年大概需要花 40 分钟，所以从 2005 年计算到 2100 就大致需要 6 个小时。大概是对比其他国家而言，流域本身的面积非常大。 等不下去了，回家。周五个别 zemi，明天还得来做资料。","content":"<h4 id=\"2025-10-15-周三\"><a href=\"#2025-10-15-周三\" class=\"headerlink\" title=\"2025&#x2F;10&#x2F;15 周三\"></a>2025&#x2F;10&#x2F;15 周三</h4><p>今天的研究终于取得了一些进展。写模型的老师告诉了我把 AIMPLUM 的 Aglu 版 的设定更改为 global: on 之后对应的 Plum.sh 的修改。至此，困扰了我和前辈一个月的模型 bug 终于被解决了。其实连一个 bug 都算不上，如果老师能在递交模型的时候告诉我们，就不会有后续的麻烦了。困る。</p>\n<p>截止写总结，模型已经运行了 3.5 小时了，仍然没有结束。对于俄罗斯和加拿大的每个流域，每计算 10 年大概需要花 40 分钟，所以从 2005 年计算到 2100 就大致需要 6 个小时。大概是对比其他国家而言，流域本身的面积非常大。</p>\n<p>等不下去了，回家。周五个别 zemi，明天还得来做资料。</p>\n","categories":[{"name":"daily","slug":"daily","permalink":"https://middlemanz.com/categories/daily/"},{"name":"日常","slug":"daily/日常","permalink":"https://middlemanz.com/categories/daily/%E6%97%A5%E5%B8%B8/"}],"tags":[{"name":"生活","slug":"生活","permalink":"https://middlemanz.com/tags/%E7%94%9F%E6%B4%BB/"},{"name":"日常","slug":"日常","permalink":"https://middlemanz.com/tags/%E6%97%A5%E5%B8%B8/"}]},{"title":"财团旅游2025","text":"这是财团旅游的第四年了，也意味着我在财团度过了第四个年头。 这次旅游的目的地是秋田和岩手县，二者都位于日本的东北部。10月8日早乘坐6点的东海道新干线，从京都出发，在东京乘换东日本新干线后，在中午11:30点便到达了盛岡。 财团组织的旅游是托管式的，所谓托管式，就是财团把一切——从交通、酒店到景点、三餐全部安排妥当。在旅游之前，财团会把行程安排，奖学生介绍等印刷成册，随新干线的车票一起邮寄到家。到了旅游那天只需要拿着这些资料既可。统筹安排的过程对于财团而言必然是繁琐的，但对于奖学生们来说，旅游就是完全的放松之旅。只要扔掉脑子，听从安排既可。 于盛岡站出来后，我们先去了ホテルメトロポリタン盛岡吃了午饭。午饭是日式中华——食之无味，弃之可惜。不过因为晚上的宴席是19点，也只能耐心的把食物吃完。 财团对于时间一向是不吝啬的，从8日中午到达到10日中午解散，两天整的行程满打满算也只有四个景点，也就是每个上午和下午只有一个。日本的景点大多都不大，不是很需要时间参观。所以财团会把每一个步骤的时间安排的很长。比如吃饭，第一天的午餐从十一点半开始，满打满算吃了一个半小时，下午1点才正式出发。而饭本身没有很复杂，我一般二十分钟就能吃完，剩下的时间就是和其他奖学生交谈。可能对于财团而言，组织修学旅行的目的并不是观光本身，而是给奖学生提供交流的机会吧。","content":"<p>这是财团旅游的第四年了，也意味着我在财团度过了第四个年头。</p>\n<p>这次旅游的目的地是秋田和岩手县，二者都位于日本的东北部。10月8日早乘坐6点的东海道新干线，从京都出发，在东京乘换东日本新干线后，在中午11:30点便到达了盛岡。</p>\n<p>财团组织的旅游是托管式的，所谓托管式，就是财团把一切——从交通、酒店到景点、三餐全部安排妥当。在旅游之前，财团会把行程安排，奖学生介绍等印刷成册，随新干线的车票一起邮寄到家。到了旅游那天只需要拿着这些资料既可。统筹安排的过程对于财团而言必然是繁琐的，但对于奖学生们来说，旅游就是完全的放松之旅。只要扔掉脑子，听从安排既可。</p>\n<p>于盛岡站出来后，我们先去了ホテルメトロポリタン盛岡吃了午饭。午饭是日式中华——食之无味，弃之可惜。不过因为晚上的宴席是19点，也只能耐心的把食物吃完。</p>\n<p>财团对于时间一向是不吝啬的，从8日中午到达到10日中午解散，两天整的行程满打满算也只有四个景点，也就是每个上午和下午只有一个。日本的景点大多都不大，不是很需要时间参观。所以财团会把每一个步骤的时间安排的很长。比如吃饭，第一天的午餐从十一点半开始，满打满算吃了一个半小时，下午1点才正式出发。而饭本身没有很复杂，我一般二十分钟就能吃完，剩下的时间就是和其他奖学生交谈。可能对于财团而言，组织修学旅行的目的并不是观光本身，而是给奖学生提供交流的机会吧。</p>\n","categories":[{"name":"daily","slug":"daily","permalink":"https://middlemanz.com/categories/daily/"},{"name":"旅行","slug":"daily/旅行","permalink":"https://middlemanz.com/categories/daily/%E6%97%85%E8%A1%8C/"}],"tags":[{"name":"旅游","slug":"旅游","permalink":"https://middlemanz.com/tags/%E6%97%85%E6%B8%B8/"},{"name":"奖学金","slug":"奖学金","permalink":"https://middlemanz.com/tags/%E5%A5%96%E5%AD%A6%E9%87%91/"}]}]